Revit 2027 API
DirectShape.AddReferencePoint Method
Overload List
Name | Description
AddReferencePoint(XYZ) |  Adds a reference point to the DirectShape.
AddReferencePoint(XYZ, DirectShapeReferenceOptions) |  Adds a reference point to the DirectShape.
Top
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace